blog/paired-commands-and-hydra.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-09-16 Wed 10:02 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Emacs: paired Commands — Efficient Keyboard Interaction Using Hydra</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="T.V Raman" />
</head>
<body>
<div id="content">
<h1 class="title">Emacs: paired Commands — Efficient Keyboard Interaction Using Hydra</h1>
<div id="outline-container-org73c4e9b" class="outline-2">
<h2 id="org73c4e9b"><span class="section-number-2">1</span> Executive Summary</h2>
<div class="outline-text-2" id="text-1">
<p>
Emacs commands such as <code>yank</code> and <code>yank-pop</code> or <code>undo-only</code> and
<code>undo-redo</code> come in logical pairs.  Such logical pairs (or command
tuples in general) are characterized by the fact that one often
invokes a sequence of these commands repeatedly until the desired
result is attained.  Package <a href="https://github.com/abo-abo/hydra">Hydra</a> defines an elegant means of
combining such command pairs into a single higher-level command that
can be invoked more efficiently from the keyboard.
To my knowledge, the only built-in Emacs command that exhibits a
similar behavior is Emacs' <code>text-scale-adjust</code>.
</p>
</div>

<div id="outline-container-org64c9374" class="outline-3">
<h3 id="org64c9374"><span class="section-number-3">1.1</span> Example: <code>undo-oanly</code> And <code>undo-redo</code></h3>
<div class="outline-text-3" id="text-1-1">
<p>
Command <code>undo-only</code> allows one to  move back through a sequence of
changes.Command <code>undo-redo</code> in contrast <i>undoes</i> previous undo
commands.
In practice, one often moves back through a sequence of operations,
with a few <code>undo-redo</code> invocations mixed in if one moves back too far.
</p>

<p>
Emacs convention would suggest that one bind these commands to
separate keys, but this has a few disadvantages:
</p>

<ul class="org-ul">
<li>Binding separate keys to the two commands feels wasteful,
especially as unbound keys in Emacs become increasingly precious.</li>
<li>It's not ergonomic  to jump between the two commands in this pair
unless one chooses the key-bindings <i>carefully</i> &#x2014; as an example,
I used <span class="underline">C-x u</span> for <code>undo-only and _C-x C-u</code> for <code>undo-redo</code> for
many years. But now, a continuous sequence of undo operations
requires too much chording.</li>
</ul>
</div>
</div>

<div id="outline-container-orgb11bab7" class="outline-3">
<h3 id="orgb11bab7"><span class="section-number-3">1.2</span> A Hydra Inspired Solution</h3>
<div class="outline-text-3" id="text-1-2">
<ol class="org-ol">
<li>Combine the two commands into a higher-level command.</li>
<li>Bind that command to a single key, in my case <span class="underline">C-/</span> (<i>C-_</i> on a tty).</li>
<li>When invoked, the Hydra-defined command does one of the following:
<ol class="org-ol">
<li>Invokes <code>undo-only</code>  on being called, then continues to read keys.</li>
<li>Subsequent presses of <span class="underline">/</span> invoke command <code>undo-only</code>.</li>
<li>Pressing <span class="underline">\</span> invokes <code>undo-redo</code>.</li>
<li>Any other key quits the Hydra-generated higher-level command.</li>
</ol></li>
</ol>

<p>
This is defined as part of Emacspeak's collection of <a href="https://github.com/tvraman/emacspeak/blob/master/lisp/emacspeak-muggles.el#L1">Muggles</a>, as is evident, this is much nicer to  your wrists.
</p>


<div class="org-src-container">
<pre class="src src-emacs-lisp">(global-set-key
 (kbd "C-/") 
 (defhydra emacspeak-muggles-undo-only/undo-redo
   (:body-pre (emacspeak-hydra-body-pre "Undo Smartly")
              :pre
              (progn
                (when hydra-is-helpful (emacspeak-hydra-toggle-talkative))
                (emacspeak-hydra-pre))
              :post emacspeak-hydra-post)
   "Undo"
   ("?" (emacspeak-hydra-self-help "emacspeak-muggles-undo-only/undo-redo"))
   ("/" undo-only nil)
   ("\\" undo-redo nil)))
</pre>
</div>

<p>
Note that the above can be simplified by dropping the
emacspeak-specific clauses when not using Emacspeak.
</p>
</div>
</div>

<div id="outline-container-org03c5a2b" class="outline-3">
<h3 id="org03c5a2b"><span class="section-number-3">1.3</span> Repeatable Yank/Pop From The Hydra Wiki</h3>
<div class="outline-text-3" id="text-1-3">
<p>
I originally discovered the metaphor of repeatable paired commands a
few years ago from the <a href="https://github.com/abo-abo/hydra.wiki.git">Hydra Wiki</a>  which demonstrates a <a href="https://github.com/abo-abo/hydra/wiki/Emacs">repeatable
yank/pop</a>.  To summarize its effects:
</p>

<ol class="org-ol">
<li><span class="underline">C-y</span> invokes the hydra-generated higher-level command.</li>
<li>Subsequent presses of <span class="underline">y</span> is  the same of <code>yank-pop</code>.</li>
<li>Pressing <span class="underline">Y</span> invokes <code>yank-pop</code> with a negative argument.</li>
<li>Consequence of above, you can grab the last entry on the
<code>kill-ring</code> by pressing <span class="underline">Y</span> after invoking the command &#x2014; would
take a lot more keystrokes in vanilla Emacs.</li>
<li>You can also add smart affordances such as searching the
<code>kill-ring</code> via interfaces such as <code>ido</code>.</li>
</ol>
</div>
</div>

<div id="outline-container-orgde60b9b" class="outline-3">
<h3 id="orgde60b9b"><span class="section-number-3">1.4</span> Conclusion</h3>
<div class="outline-text-3" id="text-1-4">
<p>
As Emacs gains in functionality, grouping commands into higher-level
abstractions, generating a single higher-level command that is bound
to a key, and using that invocation context to implement the  result
of subsequent keypresses is an abstraction that generalizes well.
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: 2020-09-16 Wed 00:00</p>
<p class="author">Author: T.V Raman</p>
<p class="date">Created: 2020-09-16 Wed 10:02</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
